# Taps
tap 'homebrew/cask'
tap 'buo/cask-upgrade' # <brew cu> Upgrades outdated Cask apps (https://github.com/buo/homebrew-cask-upgrade)
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers' # Cask of drivers (https://github.com/Homebrew/homebrew-cask-drivers)
tap 'heroku/brew' # heroku-cli
tap 'mongodb/brew'
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
brew 'svn' # required to brew install font casks
tap 'homebrew/cask-fonts'

# Shell
brew 'bash' # Bash 4
brew 'coreutils' # replace outdated macOS utils 
brew 'colordiff'
brew 'git'
brew 'grep'
brew 'mas' # Mac App Store from the CLI
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'htop'
brew 'hstr'
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'fortune'
brew 'lolcat'
brew 'lynx'
brew 'pandoc'
brew 'ccat'
brew 'chroma'

# Dev
brew 'yarn'
brew 'nvm' # node version manager
brew 'openjdk@17'
brew 'php'
brew 'mysql'
brew 'sqlite'
cask 'db-browser-for-sqlite'
brew 'postgresql'
cask 'pgadmin4'
brew 'vim'
cask 'visual-studio-code'
cask 'mark-text' # Markdown editor
cask 'zettlr' # Markdown editor
cask 'postman'
cask 'insomnia' # Postman alternative
cask 'meld' # GUI diff tool
brew 'lorem' # CLI Lorem Ipsum generator
cask 'cyberduck'
cask 'docker'
cask 'iterm2'
cask 'cool-retro-term'
cask 'imageoptim' # Image optimization
brew 'mackup'
brew 'asciinema'
cask 'devdocs' # electron container for devdocs.io
cask 'sourcetree'
brew 'heroku'
cask 'github'
brew 'gh' # GitHub CLI
brew 'tldr' # shortened MAN
cask 'firefox-developer-edition'
brew 'jq' # json CLI
brew 'ncdu'
cask 'google-chrome'
brew 'mongodb/brew/mongodb-community'
cask 'robo-3t'
cask 'mongodb-compass'
brew 'gradle'

# UI
cask 'inkscape'
cask 'font-ibm-plex-mono'
cask 'font-sf-pro'
cask 'font-sf-mono'
cask 'font-sf-compact'
cask 'fontforge'

# Collaboration
cask 'shuttle'
cask 'slack'
cask 'microsoft-teams'
cask 'zeplin'
cask 'skype'
cask 'franz'
cask 'zoom'

# Web
cask 'google-drive'
cask 'sync'
cask 'dropbox'

# Video
cask 'vlc'
cask 'mpv'
cask 'caption' # Subtitles retriever
cask 'musicbrainz-picard'
cask 'mediahuman-audio-converter'

# macOs
cask 'alfred'
cask 'bartender'
cask 'appcleaner'
cask 'balenaetcher' # Flash IMG/ISO to USB
cask 'desktoputility' # Show/hide desktop, library, dotfiles
cask 'rectangle' # macOs window manager
cask 'numi'
cask 'michaelvillar-timer'
# cask 'freefilesync'
cask 'grandperspective' # Disk usage stats
cask 'find-empty-folders'
cask 'dupeguru'
cask 'namechanger'
cask 'easyfind'
cask 'paragon-ntfs'
cask 'grammarly'
cask 'onlyoffice'
cask 'calibre'
cask 'garmin-express'
cask 'sensiblesidebuttons'

# macOs quicklook plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlimagesize'
cask 'qlvideo'
cask 'WebPQuickLook'

# Security
cask 'mullvadvpn'
cask 'keepassxc'
cask 'cryptomator'
cask 'switchhosts'
cask 'radio-silence'
cask 'turtl'

# App Store
mas 'ColorSlurp', id: 1287239339
mas 'WhatsApp', id: 1147396723
# mas 'Loremify', id: 1028877632 # GUI Lorem Ipsum generator
mas 'Giphy Capture', id: 668208984
mas 'Shazam', id: 897118787
mas 'iPic', id: 1101244278 # Image uploader
mas 'HotKey', id: 975890633 # System-wide hotkeys
mas 'AdGuard for Safari', id: 1440147259