# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
# Cask of drivers (https://github.com/Homebrew/homebrew-cask-drivers)
tap 'homebrew/cask-drivers'

# Install Binaries
#Amazon Web Services, no need for it yet
#brew 'awscli'
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
brew 'colordiff'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'htop'
brew 'trash'
brew 'tree'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'

# Development
brew 'php'
brew 'mysql'
brew 'node'
brew 'neovim'

# IMAGES
brew 'imageoptim-cli'
cask 'imageoptim'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'hazel'
cask 'sublime-text'
cask 'etcher' #Flash OS images to SD cards & USB drives
cask 'rocket'

cask 'firefox'
cask 'thunderbird'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'grammarly'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
cask 'now'

#collaboration tool
cask 'quip'
cask 'shuttle'
cask 'slack'

cask 'tower'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Video
# cask 'handbrake'
# cask 'aegisub'
cask 'vlc'
cask 'mpv'
cask 'caption' #subtitles

#ADDENDUM NIIC
cask 'malwarebytes'
cask 'timing'
cask 'sync'
cask 'focus'
cask 'mullvadvpn'
cask 'meteorologist'
cask 'iterm2'
cask 'keepassxc'
cask 'typora'
cask 'visual-studio-code'
cask 'desktoputility'
cask 'switchhosts'
cask 'spectacle'
cask 'daisydisk'
cask 'dupeguru'
cask 'namechanger'
cask 'cool-retro-term'

cask 'paragon-ntfs'
# Run Paragon-ntfs installer
open -a /usr/local/Caskroom/paragon-ntfs/15/FSInstaller.app

cask 'michaelvillar-timer'
cask 'easyfind'
cask 'find-empty-folders'

cask 'raindropio'


# Dev
cask 'postman'

# Computer tasks
cask 'freefilesync'
cask 'qbittorrent'
cask 'radio-silence'
cask 'grandperspective'
cask 'appcleaner'
cask 'cyberduck'

cask 'numi'
cask 'garmin-express'
cask 'libreoffice'
cask 'libreoffice-language-pack'
cask 'calibre'
cask 'musicbrainz-picard'



cask 'skype'
cask 'mamp'
cask 'standard-notes'
cask 'zeplin'


# Audio
cask 'mediahuman-audio-converter'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'betterzip'
cask 'qlimagesize'
cask 'qlvideo'

# Install Mac App Store apps
mas 'ColorDrops', id: 1277028218
mas 'LittleIpsum', id: 405772121
mas 'WhatsApp', id: 1147396723
mas 'The Unarchiver', id: 425424353
mas 'Telephone', id: 406825478
mas 'Giphy Capture', id: 668208984
mas 'Shazam', id: 897118787
mas 'Irvue', id: 1039633667