# Taps
tap 'caskroom/cask'
tap 'buo/cask-upgrade' # <brew cu> Upgrades outdated Cask apps (https://github.com/buo/homebrew-cask-upgrade)
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers' # Cask of drivers (https://github.com/Homebrew/homebrew-cask-drivers)
tap 'heroku/brew' # heroku-cli
tap 'mongodb/brew'

# Shell
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
brew 'colordiff'
brew 'git'
brew 'grep'
brew 'mas' # Mac App Store from the CLI
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'htop'
brew 'trash'
brew 'tree'
brew 'z'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'translate-shell'
brew 'fortune'
brew 'lolcat'
brew 'lynx'
brew 'pandoc'

# Dev
brew 'rbenv'
brew 'php'
brew 'mysql'
brew 'sqlite'
brew 'db-browser-for-sqlite'
cask 'postgres'
cask 'pgadmin4'
# brew 'node' # Disabled in favor of nvm
brew 'vim'
cask 'java'
cask 'mysqlworkbench'
cask 'mamp'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'typora' # Markdown editor
cask 'postman'
cask 'cyberduck'
cask 'meld' # GUI diff tool
brew 'lorem' # CLI Lorem Ipsum generator
cask 'transmit'
cask 'tower'
cask 'now' # Project deployment
cask 'docker'
cask 'insomnia' # REST client
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'focus' # No focus, no dev
cask 'timing'
cask 'iterm2'
cask 'cool-retro-term'
cask 'imageoptim' # Image optimization
brew 'imageoptim-cli'
brew 'mackup'
brew 'asciinema'
cask 'devdocs' # self-hosted app container for devdocs.io
cask 'fontforge'
cask 'sourcetree'
brew 'heroku'
## Dev - back-end
brew 'mongodb-community@4.2'
cask 'robo-3t'
cask 'mongodb-compass'
brew 'gradle'

# Collaboration
# cask 'quip'
cask 'shuttle'
cask 'slack'
cask 'zeplin'
cask 'skype'
cask 'franz'
cask 'zoom'

# Internet
cask 'google-chrome'
cask 'google-backup-and-sync'
cask 'firefox'
cask 'thunderbird'
cask 'raindropio' # Bookmarks sync service
cask 'dropbox'
cask 'sync'
cask 'qbittorrent'
cask 'nextcloud'
brew 'syncthing'

# Video
cask 'vlc'
cask 'mpv'
cask 'caption' # Subtitles retriever
cask 'musicbrainz-picard'
cask 'mediahuman-audio-converter'

# macOs
cask 'alfred'
cask 'bartender'
cask 'apptivate' # System-wide hotkeys
cask 'appcleaner'
cask 'balenaetcher' # Flash IMG/ISO to USB
cask 'cronnix' # Cron jobs manager
cask 'desktoputility' # Show/hide desktop, library, dotfiles
cask 'spectacle' # Window manager
cask 'caffeine'
# cask 'rocket' # Emojis galore 🎷 >> redundant with Apple's emoji tray
cask 'numi'
cask 'aerial' # Apple TV Aerial Views Screen Saver
cask 'michaelvillar-timer'
cask 'freefilesync'
cask 'daisydisk' # Disk usage stats
cask 'grandperspective' # Disk usage stats
cask 'hazel' # Automated folder organization
cask 'find-empty-folders'
cask 'dupeguru'
cask 'namechanger'
cask 'easyfind'
cask 'paragon-ntfs'
cask 'grammarly'
cask 'libreoffice'
cask 'libreoffice-language-pack'
cask 'calibre'
cask 'garmin-express'
cask 'go2shell'
cask 'sensiblesidebuttons'

# macOs quicklook plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlimagesize'
cask 'qlvideo'
cask 'WebPQuickLook'

# Security
cask 'mullvadvpn'
cask 'keepassxc'
cask 'cryptomator'
cask 'switchhosts'
cask 'radio-silence'
cask 'turtl'
cask 'gpg-suite'
cask 'malwarebytes'

# Hardware
cask 'logitech-options'
cask 'ubiquiti-unifi-controller'
cask 'wakeonlan'

# App Store
mas 'ColorDrops', id: 1277028218
mas 'Telephone', id: 406825478 # SIP app
mas 'WhatsApp', id: 1147396723
mas 'Loremify', id: 1028877632 # GUI Lorem Ipsum generator
mas 'Giphy Capture', id: 668208984
mas 'Shazam', id: 897118787
mas 'The Unarchiver', id: 425424353
mas 'Irvue', id: 1039633667 # Wallpaper manager
mas 'iPic', id: 1101244278 # Image uploader